Autodesk.Revit.DB.IFC.IFCConnectedWallDataLocation
An enumerated type that represents the location where an element is connected to a wall.
Since:
2012

Autodesk.Revit.DB.IFC.IFCConnectedWallDataLocation.NotDefined
The connection type is not defined for this connection.

Autodesk.Revit.DB.IFC.IFCConnectedWallDataLocation.Path
The conection is at some point along the path of the location line.

Autodesk.Revit.DB.IFC.IFCConnectedWallDataLocation.End
The connection is at the end of the wall location line.

Autodesk.Revit.DB.IFC.IFCConnectedWallDataLocation.Start
The connection is at the start of the wall location line.